ec/app/controllers/gears_controller.rb

SELECT "gears".* FROM "gears" INNER JOIN (SELECT "gears"."id" AS pg_search_id, (ts_rank((to_tsvector('simple', coalesce("gears"."name"::text, ''))), (to_tsquery('simple', ''' ' || 'a' || ' ''')), 0)) AS rank FROM "gears" WHERE (((to_tsvector('simple', coalesce("gears"."name"::text, ''))) @@ (to_tsquery('simple', ''' ' || 'a' || ' '''))))) AS pg_search_1d30a0049c5b5666a1f871 ON "gears"."id" = pg_search_1d30a0049c5b5666a1f871.pg_search_id ORDER BY pg_search_1d30a0049c5b5666a1f871.rank DESC, "gears"."id" ASC
SELECT COUNT(*) FROM "gears" INNER JOIN (SELECT "gears"."id" AS pg_search_id, (ts_rank((to_tsvector('simple', coalesce("gears"."name"::text, ''))), (to_tsquery('simple', ''' ' || '123' || ' ''')), 0)) AS rank FROM "gears" WHERE (((to_tsvector('simple', coalesce("gears"."name"::text, ''))) @@ (to_tsquery('simple', ''' ' || '123' || ' '''))))) AS pg_search_1d30a0049c5b5666a1f871 ON "gears"."id" = pg_search_1d30a0049c5b5666a1f871.pg_search_id
---
  def index
    # @brand = Brand.find(:all)
    # @type = Type.find(:all)
    # @gears = Gear.all.paginate(page: params[:page], per_page: 3)
    if params[:query].present?
      @gears = Gear.search_name(params[:query]).paginate(page: params[:page], per_page: 1)

SELECT "brands".* FROM "brands"
SELECT "types".* FROM "types"
---
  def new
    @gear = Gear.new
    @brand = Brand.all
    @type = Type.all

INSERT INTO "gears" ("name", "description", "price", "inventory", "brand_id", "type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @gear = Gear.new(gear_params)
    @brand = Brand.all
    @type = Type.all
    respond_to do |format|
      if @gear.save

UPDATE "gears" SET "name" = $1, "updated_at" = $2 WHERE "gears"."id" = $3  [["name", "123"], ["updated_at", "2018-06-13 10:11:32.890654"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @gear.update(gear_params)

SELECT  "gears".* FROM "gears" WHERE "gears"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_gear
    @gear = Gear.find(params[:id])