ec/app/views/gears/_form.html.erb

SELECT "brands".* FROM "brands" ORDER BY "brands"."brandname" ASC
SELECT "brands".* FROM "brands"
---
          <%= form.label :brand %>
          <!-- <%= form.collection_select :brand, Brand.order(:brandname),:id,:brandname, include_blank: true %> -->
          <%= form.select :brand_id, options_from_collection_for_select(Brand.all, :id, :brandname) %>

SELECT "types".* FROM "types"
---
          <%= form.label :type %>
          <!-- <%= form.collection_select(:type, Type.all, :id, :typename ) %> -->
          <%= form.select :type_id, options_from_collection_for_select(Type.all, :id, :typename) %>